result/httpaf-lwt-bigstring.log
Running 1m test @ http://localhost:8000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 1286.667ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 1285.579ms, rate sampling interval: 9215ms
  Thread calibration: mean lat.: 1314.709ms, rate sampling interval: 9682ms
  Thread calibration: mean lat.: 1290.985ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 1329.674ms, rate sampling interval: 9691ms
  Thread calibration: mean lat.: 1318.251ms, rate sampling interval: 9650ms
  Thread calibration: mean lat.: 1323.345ms, rate sampling interval: 9625ms
  Thread calibration: mean lat.: 1276.090ms, rate sampling interval: 9117ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.75s    10.48s    0.94m    86.53%
    Req/Sec     2.80k     1.30k    4.38k    50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.87ms
 75.000%    6.52s 
 90.000%   21.66s 
 99.000%   44.63s 
 99.900%    0.86m 
 99.990%    0.90m 
 99.999%    0.91m 
100.000%    0.94m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.535     0.000000            1         1.00
       5.771     0.100000        99135         1.11
       7.303     0.200000       198308         1.25
       8.975     0.300000       297326         1.43
      11.231     0.400000       396457         1.67
      15.871     0.500000       495544         2.00
      26.079     0.550000       545073         2.22
    1439.743     0.600000       594646         2.50
    3139.583     0.650000       644185         2.86
    4870.143     0.700000       693731         3.33
    6524.927     0.750000       743302         4.00
    7389.183     0.775000       768064         4.44
    8187.903     0.800000       792829         5.00
   11132.927     0.825000       817663         5.71
   14213.119     0.850000       842391         6.67
   17612.799     0.875000       867170         8.00
   19562.495     0.887500       879583         8.89
   21659.647     0.900000       891973        10.00
   23871.487     0.912500       904387        11.43
   26296.319     0.925000       916722        13.33
   28934.143     0.937500       929116        16.00
   30359.551     0.943750       935398        17.78
   31768.575     0.950000       941538        20.00
   33144.831     0.956250       947713        22.86
   34701.311     0.962500       953898        26.67
   36503.551     0.968750       960078        32.00
   37552.127     0.971875       963164        35.56
   38699.007     0.975000       966279        40.00
   39911.423     0.978125       969375        45.71
   41189.375     0.981250       972559        53.33
   42401.791     0.984375       975567        64.00
   42991.615     0.985938       977103        71.11
   43614.207     0.987500       978667        80.00
   44236.799     0.989062       980243        91.43
   44892.159     0.990625       981819       106.67
   45645.823     0.992188       983318       128.00
   46104.575     0.992969       984142       142.22
   46530.559     0.993750       984868       160.00
   47054.847     0.994531       985621       182.86
   47710.207     0.995313       986407       213.33
   48496.639     0.996094       987203       256.00
   48857.087     0.996484       987564       284.44
   49217.535     0.996875       987941       320.00
   49643.519     0.997266       988355       365.71
   50036.735     0.997656       988724       426.67
   50429.951     0.998047       989112       512.00
   50593.791     0.998242       989301       568.89
   50823.167     0.998437       989522       640.00
   51019.775     0.998633       989694       731.43
   51249.151     0.998828       989882       853.33
   51576.831     0.999023       990068      1024.00
   51773.439     0.999121       990169      1137.78
   52068.351     0.999219       990287      1280.00
   52264.959     0.999316       990359      1462.86
   52494.335     0.999414       990467      1706.67
   52723.711     0.999512       990553      2048.00
   52854.783     0.999561       990600      2275.56
   53018.623     0.999609       990651      2560.00
   53084.159     0.999658       990700      2925.71
   53247.999     0.999707       990755      3413.33
   53379.071     0.999756       990813      4096.00
   53411.839     0.999780       990828      4551.11
   53444.607     0.999805       990845      5120.00
   53542.911     0.999829       990867      5851.43
   53608.447     0.999854       990893      6826.67
   53673.983     0.999878       990923      8192.00
   53706.751     0.999890       990941      9102.22
   53706.751     0.999902       990941     10240.00
   53739.519     0.999915       990956     11702.86
   53772.287     0.999927       990970     13653.33
   53870.591     0.999939       990977     16384.00
   53936.127     0.999945       990981     18204.44
   54001.663     0.999951       990991     20480.00
   54034.431     0.999957       990993     23405.71
   54099.967     0.999963       990999     27306.67
   54263.807     0.999969       991005     32768.00
   54329.343     0.999973       991012     36408.89
   54329.343     0.999976       991012     40960.00
   54362.111     0.999979       991014     46811.43
   54427.647     0.999982       991017     54613.33
   54657.023     0.999985       991025     65536.00
   54657.023     0.999986       991025     72817.78
   54657.023     0.999988       991025     81920.00
   54657.023     0.999989       991025     93622.86
   54689.791     0.999991       991026    109226.67
   54722.559     0.999992       991028    131072.00
   54820.863     0.999993       991029    145635.56
   54820.863     0.999994       991029    163840.00
   54951.935     0.999995       991030    187245.71
   55017.471     0.999995       991031    218453.33
   55279.615     0.999996       991032    262144.00
   55279.615     0.999997       991032    291271.11
   55279.615     0.999997       991032    327680.00
   55607.295     0.999997       991033    374491.43
   55607.295     0.999998       991033    436906.67
   55934.975     0.999998       991034    524288.00
   55934.975     0.999998       991034    582542.22
   55934.975     0.999998       991034    655360.00
   55934.975     0.999999       991034    748982.86
   55934.975     0.999999       991034    873813.33
   56262.655     0.999999       991035   1048576.00
   56262.655     1.000000       991035          inf
#[Mean    =     5746.477, StdDeviation   =    10476.681]
#[Max     =    56229.888, Total count    =       991035]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1160852 requests in 1.00m, 2.26GB read
  Socket errors: connect 3247, read 4401, write 0, timeout 78000
Requests/sec:  19345.82
Transfer/sec:     38.63MB