result/httpaf-lwt.log
Running 1m test @ http://localhost:8000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 276.113ms, rate sampling interval: 131ms
  Thread calibration: mean lat.: 285.900ms, rate sampling interval: 143ms
  Thread calibration: mean lat.: 285.404ms, rate sampling interval: 143ms
  Thread calibration: mean lat.: 314.726ms, rate sampling interval: 182ms
  Thread calibration: mean lat.: 315.558ms, rate sampling interval: 187ms
  Thread calibration: mean lat.: 330.973ms, rate sampling interval: 203ms
  Thread calibration: mean lat.: 310.337ms, rate sampling interval: 187ms
  Thread calibration: mean lat.: 305.890ms, rate sampling interval: 172ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   264.06ms    2.07s   35.09s    98.30%
    Req/Sec     3.81k   543.33     5.44k    61.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.35ms
 75.000%   31.74ms
 90.000%   45.98ms
 99.000%   11.02s 
 99.900%   29.84s 
 99.990%   34.34s 
 99.999%   34.73s 
100.000%   35.13s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.287     0.000000            1         1.00
      13.119     0.100000       132820         1.11
      15.647     0.200000       265565         1.25
      17.919     0.300000       399175         1.43
      20.047     0.400000       531011         1.67
      22.351     0.500000       663833         2.00
      23.631     0.550000       730177         2.22
      25.071     0.600000       796705         2.50
      26.815     0.650000       862861         2.86
      28.959     0.700000       929158         3.33
      31.743     0.750000       995490         4.00
      33.407     0.775000      1028888         4.44
      35.263     0.800000      1062381         5.00
      37.375     0.825000      1095444         5.71
      39.807     0.850000      1128586         6.67
      42.623     0.875000      1161718         8.00
      44.191     0.887500      1178032         8.89
      45.983     0.900000      1194809        10.00
      47.903     0.912500      1211220        11.43
      50.143     0.925000      1227926        13.33
      52.799     0.937500      1244380        16.00
      54.335     0.943750      1252769        17.78
      55.999     0.950000      1260975        20.00
      58.079     0.956250      1269321        22.86
      60.863     0.962500      1277572        26.67
      64.447     0.968750      1285831        32.00
      67.199     0.971875      1290027        35.56
      70.975     0.975000      1294141        40.00
      79.359     0.978125      1298282        45.71
     187.135     0.981250      1302423        53.33
    4177.919     0.984375      1306579        64.00
    6008.831     0.985938      1308685        71.11
    7954.431     0.987500      1310720        80.00
    9854.975     0.989062      1312809        91.43
   11788.287     0.990625      1314874       106.67
   13697.023     0.992188      1317025       128.00
   14614.527     0.992969      1318001       142.22
   15564.799     0.993750      1319029       160.00
   16588.799     0.994531      1320134       182.86
   17481.727     0.995313      1321094       213.33
   18399.231     0.996094      1322136       256.00
   18956.287     0.996484      1322687       284.44
   19808.255     0.996875      1323164       320.00
   21463.039     0.997266      1323714       365.71
   23314.431     0.997656      1324221       426.67
   25198.591     0.998047      1324722       512.00
   26148.863     0.998242      1324977       568.89
   27181.055     0.998437      1325246       640.00
   28098.559     0.998633      1325498       731.43
   28983.295     0.998828      1325756       853.33
   30146.559     0.999023      1326066      1024.00
   30457.855     0.999121      1326150      1137.78
   31031.295     0.999219      1326318      1280.00
   31342.591     0.999316      1326402      1462.86
   31965.183     0.999414      1326570      1706.67
   32489.471     0.999512      1326680      2048.00
   32587.775     0.999561      1326738      2275.56
   32899.071     0.999609      1326822      2560.00
   33226.751     0.999658      1326906      2925.71
   33423.359     0.999707      1326932      3413.33
   33538.047     0.999756      1326990      4096.00
   33849.343     0.999780      1327074      4551.11
   33849.343     0.999805      1327074      5120.00
   34045.951     0.999829      1327100      5851.43
   34177.023     0.999854      1327158      6826.67
   34177.023     0.999878      1327158      8192.00
   34340.863     0.999890      1327184      9102.22
   34340.863     0.999902      1327184     10240.00
   34471.935     0.999915      1327242     11702.86
   34471.935     0.999927      1327242     13653.33
   34471.935     0.999939      1327242     16384.00
   34471.935     0.999945      1327242     18204.44
   34504.703     0.999951      1327245     20480.00
   34734.079     0.999957      1327303     23405.71
   34734.079     0.999963      1327303     27306.67
   34734.079     0.999969      1327303     32768.00
   34734.079     0.999973      1327303     36408.89
   34734.079     0.999976      1327303     40960.00
   34734.079     0.999979      1327303     46811.43
   34734.079     0.999982      1327303     54613.33
   34734.079     0.999985      1327303     65536.00
   34734.079     0.999986      1327303     72817.78
   34734.079     0.999988      1327303     81920.00
   34734.079     0.999989      1327303     93622.86
   34734.079     0.999991      1327303    109226.67
   34734.079     0.999992      1327303    131072.00
   34734.079     0.999993      1327303    145635.56
   34734.079     0.999994      1327303    163840.00
   34734.079     0.999995      1327303    187245.71
   34734.079     0.999995      1327303    218453.33
   34832.383     0.999996      1327306    262144.00
   34832.383     0.999997      1327306    291271.11
   34832.383     0.999997      1327306    327680.00
   34832.383     0.999997      1327306    374491.43
   34832.383     0.999998      1327306    436906.67
   35127.295     0.999998      1327309    524288.00
   35127.295     1.000000      1327309          inf
#[Mean    =      264.062, StdDeviation   =     2072.850]
#[Max     =    35094.528, Total count    =      1327309]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1707517 requests in 1.00m, 3.33GB read
  Socket errors: connect 0, read 1798, write 0, timeout 0
Requests/sec:  28455.87
Transfer/sec:     56.83MB